docs/ldsc.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-08 Fri 11:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Snakemake Pipeline for LD score Regression</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Nicholas Knoblauch">
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Snakemake Pipeline for LD score Regression</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3332ea4">Running LDSC</a>
<ul>
<li><a href="#org65baa36">Downloading data</a></li>
<li><a href="#org9e505f2">Preprocessing</a></li>
<li><a href="#org47333f8">Computing LD scores and estimating heritability</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3332ea4" class="outline-2">
<h2 id="org3332ea4">Running LDSC</h2>
<div class="outline-text-2" id="text-org3332ea4">
<p>
I have my own fork of ldsc that formats output so that it's easier to read.   <a href="https://github.com/xinhe-lab/ldsc/">It can be found here</a>
</p>
</div>

<div id="outline-container-org65baa36" class="outline-3">
<h3 id="org65baa36">Downloading data</h3>
<div class="outline-text-3" id="text-org65baa36">
<p>
We'll need the baseline LD scores as well as the reference panel so we can compute our 
own LD scores on the same set of SNPs and samples with different annotations.  For working with other annotations,
(including PTB related annotations) look <a href="https://crerecombinase.github.io/ptb_workflowr/annotation.html">here</a>.
</p>


<p>
The tangled file: <code>../workflow/dl_ldsc_snakefile</code> can be found here: <a href="https://github.com/ptb_workflowr/tree/master/workflow/dl_ldsc_snakefile">https://github.com/ptb_workflowr/tree/master/workflow/dl_ldsc_snakefile</a>
</p>
<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_baseline_model</span>:
<span style="color: #FFABAB;">"""Download 'baseline' LD model v 2.2"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">'DL'</span>]+<span style="color: #FFABAB;">"1000G_Phase3_baselineLD_v2.2_ldscores.tgz"</span>)
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"wget https://data.broadinstitute.org/alkesgroup/LDSCORE/1000G_Phase3_baselineLD_v2.2_ldscores.tgz -O {output}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gunzip_baseline</span>:
<span style="color: #FFABAB;">"""unzip baseline v2.2 model ld scores"""</span>    
    <span style="color: #99D6FF;">input</span>:
        config_d[<span style="color: #FFABAB;">'DL'</span>] +<span style="color: #FFABAB;">"1000G_Phase3_baselineLD_v2.2_ldscores.tgz"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">ldfiles</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
        <span style="color: #FF9326;">annotf</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.annot.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
        <span style="color: #FF9326;">m50</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.M_5_50"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23))
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">L2</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"tar -xvzf {input} -C {params.L2}/baseline"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_weights</span>:
<span style="color: #FFABAB;">"""Download baseline LDscore weights (needed to run LD score regression)"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">"DL"</span>]+<span style="color: #FFABAB;">"1000G_Phase3_weights_hm3_no_MHC.tgz"</span>)
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"wget https://data.broadinstitute.org/alkesgroup/LDSCORE/1000G_Phase3_weights_hm3_no_MHC.tgz -O {output}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gunzip_weights</span>:
<span style="color: #FFABAB;">"""unzip baseline weights"""</span>
    <span style="color: #99D6FF;">input</span>:
        config_d[<span style="color: #FFABAB;">"DL"</span>]+<span style="color: #FFABAB;">"1000G_Phase3_weights_hm3_no_MHC.tgz"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">ldfiles</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'WEIGHTS'</span>] +<span style="color: #FFABAB;">"weights.hm3_noMHC.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23))
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">W</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>]
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"tar -xvzf {input} -C {params.W}"</span>        

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_plinkfiles</span>:
<span style="color: #FFABAB;">"""Download tar.gz of (european) reference panel genotypes"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">'DL'</span>] +<span style="color: #FFABAB;">"1000G_Phase3_plinkfiles.tgz"</span>)
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"wget https://data.broadinstitute.org/alkesgroup/LDSCORE/1000G_Phase3_plinkfiles.tgz -O {output}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gunzip_plinkfiles</span>:
<span style="color: #FFABAB;">"""Unzip downloaded reference panel genotypes"""</span>
    <span style="color: #99D6FF;">input</span>:
        config_d[<span style="color: #FFABAB;">'DL'</span>] +<span style="color: #FFABAB;">"1000G_Phase3_plinkfiles.tgz"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">fam_files</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'1KG'</span>] +<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.fam"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
        <span style="color: #FF9326;">bim_files</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'1KG'</span>] +<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
        <span style="color: #FF9326;">bed_files</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'1KG'</span>] +<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bed"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23))
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">KG</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>]
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"tar -xvzf {input} -C {params.KG}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_frq</span>:
<span style="color: #FFABAB;">"""Download allele frequency data for phase 3 genotypes"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">'DL'</span>]+<span style="color: #FFABAB;">"1000G_Phase3_frq.tgz"</span>)
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"wget https://data.broadinstitute.org/alkesgroup/LDSCORE/1000G_Phase3_frq.tgz -O {output}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gunzip_frqf</span>:
<span style="color: #FFABAB;">"""unzip allele frequency data"""</span>
    <span style="color: #99D6FF;">input</span>:
        config_d[<span style="color: #FFABAB;">'DL'</span>] +<span style="color: #FFABAB;">"1000G_Phase3_frq.tgz"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">fam_files</span> = <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'FRQF'</span>] +<span style="color: #FFABAB;">"1000G.EUR.QC.{chrom}.frq"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">KG</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>]
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"tar -xvzf {input} -C {params.KG}"</span>

</pre>
</div>
</div>
</div>
