org/ldsc.org
** Preprocessing

I have added some R scripts to make preparing the data easier. This section of the snakemake pipeline is a combo of my R scripts and ldsc calls for data prep.


#+BEGIN_SRC snakemake :mkdirp :tangle ../workflow/ldsc_snakefile
  rule indexgwas2h5:
      """Starting with a copy of the gwas summary statistics, pull out the subset that match at the SNPs we have baseline LD for"""    
      input:
          inputf=config_d['GWAS'] +"{gwas}_gwas.h5",
          indexf=config_d['L2'] +"baseline/baselineLD.{chrom}.l2.ldscore.gz"
      params:
          chrom="{chrom}"
      output:
          outputf=temp(config_d['GWAS'] +"hm3_index/{gwas}_gwas_hm_chr{chrom}.tsv")
      conda:
          config_e['r']
      script:
          "../scripts/index_gwas.R"

  rule make_annot:
      """Create per-annotation annot files for each bed file"""        
      input:
          anno_bed=ancient(config_d['BED'] +"{annot}.bed"),
          bim=config_d['1KG'] + "1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim"
      output:
          annot = config_d['L2'] +"{annot}.{chrom}.annot.gz"
      params:
          anno_name='{annot}'
      conda:
          config_e['ldsc']
      shell:
          config_d['LDSC']+"make_annot.py --bed-file {input.anno_bed} --bimfile {input.bim} --annot-file {output.annot} --annot-name {params.anno_name}"

  rule prep_ldsc_sumstsat:
      """Create ldsc formatted summary statistics (or at least suitable for merge_sumstats.py)"""        
      input:
          inputf=expand(config_d['GWAS'] +"hm3_index/{{gwas}}_gwas_hm_chr{chrom}.tsv",chrom=range(1,23))
      params:
          gwas_t=""
      output:
          outputf=temp(config_d['GWAS'] +"ldsc_input_pre/{gwas}_gwas.sumstats.gz")
      conda:
          config_e['r']
      script:
          "../scripts/gen_ldsc_sumstats.R"

  rule check_ldsc_sumstat:
      """Let LDSC do a final pre-processing of the summary statistics"""
      input:
          config_d['GWAS'] +"ldsc_input_pre/{gwas}_gwas.sumstats.gz"
      output:
          outputf=config_d['GWAS'] +"ldsc_input/{gwas}_gwas.sumstats.gz"
      params:
          outputf=config_d['GWAS'] +"ldsc_input/{gwas}_gwas"
      conda:
          config_e['ldsc']
      log:
          logf=config_d['GWAS'] +"ldsc_input/{gwas}_gwas.log"
      shell:
          config_d['LDSC']+"munge_sumstats.py --sumstats {input} --out {params.outputf}"


  rule pull_rsid:
      """Generate a snplist file from an ldscore file"""    
      input:        
          config_d["L2"]+"baseline/baselineLD.{chrom}.l2.ldscore.gz"
      output:
          temp(config_d["L2"]+"snplist/{chrom}.snplist.txt")
      shell:
          "zcat {input} | cut -f 2 | tail -n +2 > {output}"


  # TODO remove this
  #""" This is an awful hack I came up with so that ld scores don't get recomputed, and I should get rid of it"""
  def norr_ldsc(wildcards):
      chrom = wildcards.chrom
      annot = wildcards.annot
      anno_bed=config_d['L2'] +f"{annot}.{chrom}.annot.gz"
      snplistf=config_d["L2"]+f"snplist/{chrom}.snplist.txt"
      bim=config_d['1KG'] + f"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim"
      bed=config_d['1KG'] + f"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bed"
      fam=config_d['1KG'] + f"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.fam"
      l2=(config_d['L2']+f"{annot}.{chrom}.l2.M")
      l2M_50=(config_d['L2']+f"{annot}.{chrom}.l2.M_5_50")
      l2gz=(config_d['L2']+f"{annot}.{chrom}.l2.ldscore.gz")
      if all(os.path.exists(x) for x in [l2,l2M_50,l2gz]):
          return {}
      else:
          return {'anno_bed': anno_bed,
                  'snplistf': snplistf,
                  'bim': bim,
                  'bed': bed,
                  'fam': fam}

  rule cmp_ldscores:
      """ Compute stratified ld scores for the single annotation at a single chromosome"""
      input:
          unpack(norr_ldsc)
      output:
          l2=(config_d['L2']+"{annot}.{chrom}.l2.M"),
          l2M_50=(config_d['L2']+"{annot}.{chrom}.l2.M_5_50"),
          l2gz=(config_d['L2']+"{annot}.{chrom}.l2.ldscore.gz")
      params:
          plink=config_d['1KG'] + "1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}",
          odir=config_d['L2']+"{annot}.{chrom}",
          anno="{annot}"
      wildcard_constraints:
          annot="[^/]+"
      conda:
          config_e['ldsc']
      shell:
          config_d['LDSC']+"ldsc.py --l2 --bfile {params.plink} --print-snps {input.snplistf} --ld-wind-cm 1 --thin-annot --annot {input.anno_bed} --out {params.odir} && cp {output.l2gz} {output.l2gz}~ && zcat {output.l2gz}~ | sed '1s/L2/{params.anno}/' | gzip  > {output.l2gz} && rm {output.l2gz}~"


#+END_SRC



#+BEGIN_SRC snakemake :mkdirp :tangle ../workflow/baseline_ldsc_snakefile

  rule cmp_baselineb_ldscores:
      """ Compute baseline ld scores for the single annotation at a single chromosome"""
      input:
          bim=config_d['1KG'] + "1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim",
          bed=config_d['1KG'] + "1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bed",
          fam=config_d['1KG'] + "1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.fam"
      output:
          l2=(config_d['L2']+"true_baseline/ldsc.{chrom}.l2.M"),
          l2M_50=(config_d['L2']+"true_baseline/ldsc.{chrom}.l2.M_5_50"),
          l2gz=(config_d['L2']+"true_baseline/ldsc.{chrom}.l2.ldscore.gz")
      params:
          plink=config_d['1KG'] + "1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}",
          odir=config_d['L2']+"true_baseline/ldsc.{chrom}"
      conda:
          config_e['ldsc']
      shell:
          config_d['LDSC']+"ldsc.py --l2 --bfile {params.plink}  --ld-wind-cm 1 --out {params.odir}"

#+END_SRC

This script (~pull_ldscores_m50.R~) allows us to create subsets of the full baseline LD scores.  (see rule ~cmp_baseline_ldscores2~)

#+BEGIN_SRC R :mkdirp :tangle ../scripts/pull_ldscores_m50.R
library(vroom)
library(purrr)
library(fs)

anno_bed_if <- snakemake@input[["anno_bed"]]
l2m_if <- snakemake@input[["l2"]]
l2m50_if <- snakemake@input[["l2M_50"]]


l2m_of <- snakemake@output[["l2"]]
l2m50_of <- snakemake@output[["l2M_50"]]
pull_features <- snakemake@params[["features"]]
anno_cols <- scan(anno_bed_if,what = character(),nlines = 1)[-c(1:4)]
keep_cols <- anno_cols %in% pull_features


l2md <- scan(l2m_if,what=character(),nlines = 1)[keep_cols]
l2m50d <- scan(l2m50_if,what=character(),nlines = 1)[keep_cols]

write(paste0(l2md,collapse = "\t"), l2m_of)
write(paste0(l2m50d,collapse = "\t"),l2m50_of)
#+END_SRC

This script (~pull_ldscores.R~) allows us to create subsets of the full baseline LD scores.  (see rule ~cmp_baseline_ldscores~)

#+BEGIN_SRC R :mkdirp :tangle ../scripts/pull_ldscores.R

  library(vroom)
  library(purrr)
  library(fs)

  anno_bed_if <- snakemake@input[["anno_bed"]]
  l2gz_if <- snakemake@input[["l2gz"]]

  anno_bed_of <- snakemake@output[["anno_bed"]]
  l2gz_of <- snakemake@output[["l2gz"]]
  pull_features <- snakemake@params[["features"]]

  annot_prefix <- c("CHR","BP","SNP","CM")
  annot_cols <- c(annot_prefix, pull_features)
  names(annot_cols) <- annot_cols
  annot_cols <- map(annot_cols, ~col_guess())
  annot_cols <- vroom::cols_only(!!!annot_cols)

  l2_prefix <- c("CHR","SNP","BP")
  l2_cols <- c(l2_prefix, paste0(pull_features, "L2"))
  names(l2_cols) <- l2_cols
  l2_cols <- map(l2_cols, ~col_guess())
  l2_cols <- vroom::cols_only(!!!l2_cols)

  vroom::vroom_write(vroom::vroom(l2gz_if, delim = "\t",col_types = l2_cols),l2gz_of,delim = "\t")
  vroom::vroom_write(vroom::vroom(anno_bed_if,delim = "\t",col_types = annot_cols),anno_bed_of,delim = "\t")

#+END_SRC

