docs/ldsc.html

<div id="outline-container-org9e505f2" class="outline-3">
<h3 id="org9e505f2">Preprocessing</h3>
<div class="outline-text-3" id="text-org9e505f2">
<p>
I have added some R scripts to make preparing the data easier. This section of the snakemake pipeline is a combo of my R scripts and ldsc calls for data prep.
</p>


<p>
The tangled file: <code>../workflow/ldsc_snakefile</code> can be found here: <a href="https://github.com/ptb_workflowr/tree/master/workflow/ldsc_snakefile">https://github.com/ptb_workflowr/tree/master/workflow/ldsc_snakefile</a>
</p>
<div class="org-src-container">
<pre class="src src-snakemake"><span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">indexgwas2h5</span>:
    <span style="color: #6E8C02;">"""Starting with a copy of the gwas summary statistics, pull out the subset that match at the SNPs we have baseline LD for"""</span>    
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">inputf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"{gwas}_gwas.h5"</span>,
        <span style="color: #FF9326;">indexf</span>=config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.ldscore.gz"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">chrom</span>=<span style="color: #FFABAB;">"{chrom}"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">outputf</span>=<span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"hm3_index/{gwas}_gwas_hm_chr{chrom}.tsv"</span>)
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'r'</span>]
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/index_gwas.R"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">make_annot</span>:
    <span style="color: #FFABAB;">"""Create per-annotation annot files for each bed file"""</span>        
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">anno_bed</span>=<span style="color: #B46DCC;">ancient</span>(config_d[<span style="color: #FFABAB;">'BED'</span>] +<span style="color: #FFABAB;">"{annot}.bed"</span>),
        <span style="color: #FF9326;">bim</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + <span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">annot</span> = config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"{annot}.{chrom}.annot.gz"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">anno_name</span>=<span style="color: #FFABAB;">'{annot}'</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'ldsc'</span>]
    <span style="color: #99D6FF;">shell</span>:
        config_d[<span style="color: #FFABAB;">'LDSC'</span>]+<span style="color: #FFABAB;">"make_annot.py --bed-file {input.anno_bed} --bimfile {input.bim} --annot-file {output.annot} --annot-name {params.anno_name}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">prep_ldsc_sumstsat</span>:
    <span style="color: #FFABAB;">"""Create ldsc formatted summary statistics (or at least suitable for merge_sumstats.py)"""</span>        
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">inputf</span>=<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"hm3_index/{{gwas}}_gwas_hm_chr{chrom}.tsv"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23))
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">gwas_t</span>=<span style="color: #FFABAB;">""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">outputf</span>=<span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"ldsc_input_pre/{gwas}_gwas.sumstats.gz"</span>)
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'r'</span>]
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/gen_ldsc_sumstats.R"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">check_ldsc_sumstat</span>:
    <span style="color: #FFABAB;">"""Let LDSC do a final pre-processing of the summary statistics"""</span>
    <span style="color: #99D6FF;">input</span>:
        config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"ldsc_input_pre/{gwas}_gwas.sumstats.gz"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">outputf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"ldsc_input/{gwas}_gwas.sumstats.gz"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">outputf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"ldsc_input/{gwas}_gwas"</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'ldsc'</span>]
    <span style="color: #99D6FF;">log</span>:
        <span style="color: #FF9326;">logf</span>=config_d[<span style="color: #FFABAB;">'GWAS'</span>] +<span style="color: #FFABAB;">"ldsc_input/{gwas}_gwas.log"</span>
    <span style="color: #99D6FF;">shell</span>:
        config_d[<span style="color: #FFABAB;">'LDSC'</span>]+<span style="color: #FFABAB;">"munge_sumstats.py --sumstats {input} --out {params.outputf}"</span>


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">pull_rsid</span>:
    <span style="color: #FFABAB;">"""Generate a snplist file from an ldscore file"""</span>    
    <span style="color: #99D6FF;">input</span>:        
        config_d[<span style="color: #FFABAB;">"L2"</span>]+<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.ldscore.gz"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">"L2"</span>]+<span style="color: #FFABAB;">"snplist/{chrom}.snplist.txt"</span>)
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"zcat {input} | cut -f 2 | tail -n +2 &gt; {output}"</span>


<span style="color: #5D6A70;"># </span><span style="color: #5D6A70;">TODO remove this</span>
<span style="color: #5D6A70;">#</span><span style="color: #5D6A70;">""" This is an awful hack I came up with so that ld scores don't get recomputed, and I should get rid of it"""</span>
<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">norr_ldsc</span>(<span style="color: #B46DCC;">wildcards</span>):
    <span style="color: #FF9326;">chrom</span> = <span style="color: #B46DCC;">wildcards</span>.chrom
    <span style="color: #FF9326;">annot</span> = <span style="color: #B46DCC;">wildcards</span>.annot
    <span style="color: #FF9326;">anno_bed</span>=config_d[<span style="color: #FFABAB;">'L2'</span>] +f<span style="color: #FFABAB;">"{annot}.{chrom}.annot.gz"</span>
    <span style="color: #FF9326;">snplistf</span>=config_d[<span style="color: #FFABAB;">"L2"</span>]+f<span style="color: #FFABAB;">"snplist/{chrom}.snplist.txt"</span>
    <span style="color: #FF9326;">bim</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + f<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim"</span>
    <span style="color: #FF9326;">bed</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + f<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bed"</span>
    <span style="color: #FF9326;">fam</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + f<span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.fam"</span>
    <span style="color: #FF9326;">l2</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+f<span style="color: #FFABAB;">"{annot}.{chrom}.l2.M"</span>)
    <span style="color: #FF9326;">l2M_50</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+f<span style="color: #FFABAB;">"{annot}.{chrom}.l2.M_5_50"</span>)
    <span style="color: #FF9326;">l2gz</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+f<span style="color: #FFABAB;">"{annot}.{chrom}.l2.ldscore.gz"</span>)
    <span style="color: #C8FF03;">if</span> <span style="color: #B46DCC;">all</span>(os.path.exists(x) <span style="color: #C8FF03;">for</span> x <span style="color: #C8FF03;">in</span> [l2,l2M_50,l2gz]):
        <span style="color: #C8FF03;">return</span> {}
    <span style="color: #C8FF03;">else</span>:
        <span style="color: #C8FF03;">return</span> {<span style="color: #FFABAB;">'anno_bed'</span>: anno_bed,
                <span style="color: #FFABAB;">'snplistf'</span>: snplistf,
                <span style="color: #FFABAB;">'bim'</span>: bim,
                <span style="color: #FFABAB;">'bed'</span>: bed,
                <span style="color: #FFABAB;">'fam'</span>: fam}

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">cmp_ldscores</span>:
    <span style="color: #FFABAB;">""" Compute stratified ld scores for the single annotation at a single chromosome"""</span>
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #B46DCC;">unpack</span>(norr_ldsc)
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">l2</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"{annot}.{chrom}.l2.M"</span>),
        <span style="color: #FF9326;">l2M_50</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"{annot}.{chrom}.l2.M_5_50"</span>),
        <span style="color: #FF9326;">l2gz</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"{annot}.{chrom}.l2.ldscore.gz"</span>)
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">plink</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + <span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}"</span>,
        <span style="color: #FF9326;">odir</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"{annot}.{chrom}"</span>,
        <span style="color: #FF9326;">anno</span>=<span style="color: #FFABAB;">"{annot}"</span>
    <span style="color: #99D6FF;">wildcard_constraints</span>:
        <span style="color: #FF9326;">annot</span>=<span style="color: #FFABAB;">"[^/]+"</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'ldsc'</span>]
    <span style="color: #99D6FF;">shell</span>:
        config_d[<span style="color: #FFABAB;">'LDSC'</span>]+<span style="color: #FFABAB;">"ldsc.py --l2 --bfile {params.plink} --print-snps {input.snplistf} --ld-wind-cm 1 --thin-annot --annot {input.anno_bed} --out {params.odir} &amp;&amp; cp {output.l2gz} {output.l2gz}~ &amp;&amp; zcat {output.l2gz}~ | sed '1s/L2/{params.anno}/' | gzip  &gt; {output.l2gz} &amp;&amp; rm {output.l2gz}~"</span>


</pre>
</div>



<p>
The tangled file: <code>../workflow/baseline_ldsc_snakefile</code> can be found here: <a href="https://github.com/ptb_workflowr/tree/master/workflow/baseline_ldsc_snakefile">https://github.com/ptb_workflowr/tree/master/workflow/baseline_ldsc_snakefile</a>
</p>
<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">cmp_baselineb_ldscores</span>:
    <span style="color: #FFABAB;">""" Compute baseline ld scores for the single annotation at a single chromosome"""</span>
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">bim</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + <span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bim"</span>,
        <span style="color: #FF9326;">bed</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + <span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.bed"</span>,
        <span style="color: #FF9326;">fam</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + <span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}.fam"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">l2</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"true_baseline/ldsc.{chrom}.l2.M"</span>),
        <span style="color: #FF9326;">l2M_50</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"true_baseline/ldsc.{chrom}.l2.M_5_50"</span>),
        <span style="color: #FF9326;">l2gz</span>=(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"true_baseline/ldsc.{chrom}.l2.ldscore.gz"</span>)
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">plink</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>] + <span style="color: #FFABAB;">"1000G_EUR_Phase3_plink/1000G.EUR.QC.{chrom}"</span>,
        <span style="color: #FF9326;">odir</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"true_baseline/ldsc.{chrom}"</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'ldsc'</span>]
    <span style="color: #99D6FF;">shell</span>:
        config_d[<span style="color: #FFABAB;">'LDSC'</span>]+<span style="color: #FFABAB;">"ldsc.py --l2 --bfile {params.plink}  --ld-wind-cm 1 --out {params.odir}"</span>

</pre>
</div>

<p>
This script (<code>pull_ldscores_m50.R</code>) allows us to create subsets of the full baseline LD scores.  (see rule <code>cmp_baseline_ldscores2</code>)
</p>

<p>
The tangled file: <code>../scripts/pull_ldscores_m50.R</code> can be found here: <a href="https://github.com/ptb_workflowr/tree/master/scripts/pull_ldscores_m50.R">https://github.com/ptb_workflowr/tree/master/scripts/pull_ldscores_m50.R</a>
</p>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(vroom)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(fs)

anno_bed_if <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"anno_bed"</span>]]
l2m_if <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"l2"</span>]]
l2m50_if <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"l2M_50"</span>]]


l2m_of <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"l2"</span>]]
l2m50_of <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"l2M_50"</span>]]
pull_features <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"features"</span>]]
anno_cols <span style="color: #C04040;">&lt;-</span> scan(anno_bed_if,what = character(),nlines = 1)[-c(1:4)]
keep_cols <span style="color: #C04040;">&lt;-</span> anno_cols <span style="color: #C04040;">%in%</span> pull_features


l2md <span style="color: #C04040;">&lt;-</span> scan(l2m_if,what=character(),nlines = 1)[keep_cols]
l2m50d <span style="color: #C04040;">&lt;-</span> scan(l2m50_if,what=character(),nlines = 1)[keep_cols]

write(paste0(l2md,collapse = <span style="color: #FFABAB;">"\t"</span>), l2m_of)
write(paste0(l2m50d,collapse = <span style="color: #FFABAB;">"\t"</span>),l2m50_of)
</pre>
</div>

<p>
This script (<code>pull_ldscores.R</code>) allows us to create subsets of the full baseline LD scores.  (see rule <code>cmp_baseline_ldscores</code>)
</p>

<p>
The tangled file: <code>../scripts/pull_ldscores.R</code> can be found here: <a href="https://github.com/ptb_workflowr/tree/master/scripts/pull_ldscores.R">https://github.com/ptb_workflowr/tree/master/scripts/pull_ldscores.R</a>
</p>
<div class="org-src-container">
<pre class="src src-R">
<span style="color: #C04040;">library</span>(vroom)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(fs)

anno_bed_if <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"anno_bed"</span>]]
l2gz_if <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"l2gz"</span>]]

anno_bed_of <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"anno_bed"</span>]]
l2gz_of <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"l2gz"</span>]]
pull_features <span style="color: #C04040;">&lt;-</span> snakemake@params[[<span style="color: #FFABAB;">"features"</span>]]

annot_prefix <span style="color: #C04040;">&lt;-</span> c(<span style="color: #FFABAB;">"CHR"</span>,<span style="color: #FFABAB;">"BP"</span>,<span style="color: #FFABAB;">"SNP"</span>,<span style="color: #FFABAB;">"CM"</span>)
annot_cols <span style="color: #C04040;">&lt;-</span> c(annot_prefix, pull_features)
names(annot_cols) <span style="color: #C04040;">&lt;-</span> annot_cols
annot_cols <span style="color: #C04040;">&lt;-</span> map(annot_cols, ~col_guess())
annot_cols <span style="color: #C04040;">&lt;-</span> vroom::cols_only(!!!annot_cols)

l2_prefix <span style="color: #C04040;">&lt;-</span> c(<span style="color: #FFABAB;">"CHR"</span>,<span style="color: #FFABAB;">"SNP"</span>,<span style="color: #FFABAB;">"BP"</span>)
l2_cols <span style="color: #C04040;">&lt;-</span> c(l2_prefix, paste0(pull_features, <span style="color: #FFABAB;">"L2"</span>))
names(l2_cols) <span style="color: #C04040;">&lt;-</span> l2_cols
l2_cols <span style="color: #C04040;">&lt;-</span> map(l2_cols, ~col_guess())
l2_cols <span style="color: #C04040;">&lt;-</span> vroom::cols_only(!!!l2_cols)

vroom::vroom_write(vroom::vroom(l2gz_if, delim = <span style="color: #FFABAB;">"\t"</span>,col_types = l2_cols),l2gz_of,delim = <span style="color: #FFABAB;">"\t"</span>)
vroom::vroom_write(vroom::vroom(anno_bed_if,delim = <span style="color: #FFABAB;">"\t"</span>,col_types = annot_cols),anno_bed_of,delim = <span style="color: #FFABAB;">"\t"</span>)

</pre>
</div>
</div>
</div>
