org/ldsc.org
** Computing LD scores and estimating heritability

These rules are where the action happens.  Stratified LD scores are computed (or subset) from baseline
annotations (or LD scores), and LD score regression is run.  There's an additional rule for estimating the co-heritability.

#+BEGIN_SRC snakemake :mkdirp :tangle ../workflow/ldsc_snakefile

  rule cmp_baseline_ldscores:
      input:
          anno_bed=config_d['L2'] +"baseline/baselineLD.{chrom}.annot.gz",
          l2gz=config_d['L2'] +"baseline/baselineLD.{chrom}.l2.ldscore.gz",
      output:
          anno_bed=config_d['L2'] +"new_baseline/{new_base}.{chrom}.annot.gz",
          l2gz=config_d['L2'] +"new_baseline/{new_base}.{chrom}.l2.ldscore.gz",
      params:
          features=lambda wildcards: all_annot.get(wildcards.new_base),
          anno="{new_base}"
      script:
          "../scripts/pull_ldscores.R"

  rule cmp_baseline_ldscores2:
      input:
          anno_bed=config_d['L2'] +"baseline/baselineLD.{chrom}.annot.gz",
          l2=config_d['L2']+"baseline/baselineLD.{chrom}.l2.M",
          l2M_50=config_d['L2']+"baseline/baselineLD.{chrom}.l2.M_5_50"
      output:
          l2=config_d['L2']+"new_baseline/{new_base}.{chrom}.l2.M",
          l2M_50=config_d['L2']+"new_baseline/{new_base}.{chrom}.l2.M_5_50"
      params:
          features=lambda wildcards: all_annot.get(wildcards.new_base),
          anno="{new_base}"
      script:
          "../scripts/pull_ldscores_m50.R"

  def get_annot_files(wildcards):
          return {'anno_l2':expand(config_d['L2'] +"{anno_name}.{chrom}.l2.ldscore.gz",chrom=range(1,23),anno_name=all_annot['ptb_ldsc_model'][wildcards.anno_name]),
                  'annotf':expand(config_d['L2'] +"{anno_name}.{chrom}.annot.gz",chrom=range(1,23),anno_name=all_annot['ptb_ldsc_model'][wildcards.anno_name]),
                  'baseline_l2':expand(config_d['L2'] +"baseline/baselineLD.{chrom}.l2.ldscore.gz",chrom=range(1,23)),
                  'gwasf':config_d['GWAS'] +f"ldsc_input/{wildcards.gwas}_gwas.sumstats.gz",
                  'baselinef':  expand(config_d['WEIGHTS'] +"weights.hm3_noMHC.{chrom}.l2.ldscore.gz",chrom=range(1,23)),
                  'freqf':  expand(config_d['FRQF'] +"1000G.EUR.QC.{chrom}.frq",chrom=range(1,23)),
          }

  def get_annot_pairs(wildcards):
          return {'anno_l2':expand(config_d['L2'] +"{anno_name}.{chrom}.l2.ldscore.gz",chrom=range(1,23),anno_name=all_annot['ptb_ldsc_model'][wildcards.anno_name]),
                  'baseline_l2':expand(config_d['L2'] +"baseline/baselineLD.{chrom}.l2.ldscore.gz",chrom=range(1,23)),

                  'gwasfA':config_d['GWAS'] +f"ldsc_input/{wildcards.gwasA}_gwas.sumstats.gz",
                  'gwasfB':config_d['GWAS'] +f"ldsc_input/{wildcards.gwasB}_gwas.sumstats.gz",
                  'baselinef':  expand(config_d['WEIGHTS'] +"weights.hm3_noMHC.{chrom}.l2.ldscore.gz",chrom=range(1,23)),
                  'freqf':  expand(config_d['FRQF'] +"1000G.EUR.QC.{chrom}.frq",chrom=range(1,23)),
          }

  rule run_ldsc:
      input:
          unpack(get_annot_files)
      output:
          dataf="results/{gwas}/{anno_name}.results"
      log:
          tempf=temp("{gwas}_{anno_name}.log")
      params:
          annot=lambda wildcards: ','.join(expand(config_d['L2']+"{anno_name}.",anno_name=all_annot['ptb_ldsc_model'][wildcards.anno_name])),
          baseline=config_d['L2']+"baseline/baselineLD.",
          weights=config_d['WEIGHTS']+"weights.hm3_noMHC.",
          frq=config_d['FRQF'] +"1000G.EUR.QC.",
          odir="results/{gwas}/{anno_name}"
      conda:
          config_e['ldsc']
      shell:
          config_d['LDSC']+"ldsc.py --h2 {input.gwasf} --ref-ld-chr {params.annot},{params.baseline} --w-ld-chr {params.weights} --thin-annot --overlap-annot --frqfile-chr {params.frq} --out {params.odir} "

  rule run_ldsc_cor:
      input:
          unpack(get_annot_pairs)
      output:
          dataf="{gwasA},{gwasB}/{anno_name}.log"
      params:
          annot=lambda wildcards: ','.join(expand(config_d['L2']+"{anno_name}.",anno_name=all_annot['ptb_ldsc_model'][wildcards.anno_name])),
          baseline=config_d['L2']+"baseline/baselineLD.",
          weights=config_d['WEIGHTS']+"weights.hm3_noMHC.",
          frq=config_d['FRQF'] +"1000G.EUR.QC.",
          odir="{gwasA},{gwasB}/{anno_name}"
      conda:
          config_e['ldsc']
      shell:
          config_d['LDSC']+"ldsc.py --rg {input.gwasfA},{input.gwasfB} --ref-ld-chr {params.annot},{params.baseline} --w-ld-chr {params.weights} --thin-annot --overlap-annot --frqfile-chr {params.frq} --out {params.odir} "

  def get_new_annot_files(wildcards):

          return {'anno_l2':expand(config_d['L2'] +"{anno_name}.{chrom}.l2.ldscore.gz",chrom=range(1,23),anno_name=all_annot['ptb_ldsc_model'][wildcards.anno_name]),
                  'baseline_l2':expand(config_d['L2'] +"new_baseline/{new_base}.{chrom}.l2.ldscore.gz",chrom=range(1,23),new_base = wildcards.new_base),
                  'baseline_l2m':expand(config_d['L2'] +"new_baseline/{new_base}.{chrom}.l2.M",chrom=range(1,23),new_base = wildcards.new_base),
                  'baseline_l2m50':expand(config_d['L2'] +"new_baseline/{new_base}.{chrom}.l2.M_5_50",chrom=range(1,23),new_base = wildcards.new_base),

                  'baselinef':  expand(config_d['WEIGHTS'] +"weights.hm3_noMHC.{chrom}.l2.ldscore.gz",chrom=range(1,23)),
                  'freqf':  expand(config_d['FRQF'] +"1000G.EUR.QC.{chrom}.frq",chrom=range(1,23)),
          }

  rule run_new_ldsc:
        input:
            unpack(get_new_annot_files)
        output:
              dataf="results/{gwas}/{new_base}_{anno_name}.results"
        log:
            tempf=temp("{gwas}/{new_base}_{anno_name}.log")
        params:
            annot=lambda wildcards: ','.join(expand(config_d['L2']+"{anno_name}.",anno_name=all_annot['ptb_ldsc_model'][wildcards.anno_name])),
            baseline=config_d["L2"]+"new_baseline/{new_base}.",
            weights=config_d['WEIGHTS']+"weights.hm3_noMHC.",
            frq=config_d['FRQF'] +"1000G.EUR.QC.",
            odir="results/{gwas}/{new_base}_{anno_name}"
        conda:
            config_e['ldsc']
        shell:
            config_d['LDSC']+"ldsc.py --h2 {input.gwasf} --ref-ld-chr {params.annot},{params.baseline} --w-ld-chr {params.weights} --thin-annot --overlap-annot --frqfile-chr {params.frq} --out {params.odir}"


#+END_SRC



