docs/ldsc.html

<div id="outline-container-org47333f8" class="outline-3">
<h3 id="org47333f8">Computing LD scores and estimating heritability</h3>
<div class="outline-text-3" id="text-org47333f8">
<p>
These rules are where the action happens.  Stratified LD scores are computed (or subset) from baseline
annotations (or LD scores), and LD score regression is run.  There's an additional rule for estimating the co-heritability.
</p>

<p>
The tangled file: <code>../workflow/ldsc_snakefile</code> can be found here: <a href="https://github.com/ptb_workflowr/tree/master/workflow/ldsc_snakefile">https://github.com/ptb_workflowr/tree/master/workflow/ldsc_snakefile</a>
</p>
<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">cmp_baseline_ldscores</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">anno_bed</span>=config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.annot.gz"</span>,
        <span style="color: #FF9326;">l2gz</span>=config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.ldscore.gz"</span>,
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">anno_bed</span>=config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"new_baseline/{new_base}.{chrom}.annot.gz"</span>,
        <span style="color: #FF9326;">l2gz</span>=config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"new_baseline/{new_base}.{chrom}.l2.ldscore.gz"</span>,
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">features</span>=<span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: all_annot.get(<span style="color: #B46DCC;">wildcards</span>.new_base),
        <span style="color: #FF9326;">anno</span>=<span style="color: #FFABAB;">"{new_base}"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/pull_ldscores.R"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">cmp_baseline_ldscores2</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">anno_bed</span>=config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.annot.gz"</span>,
        <span style="color: #FF9326;">l2</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.M"</span>,
        <span style="color: #FF9326;">l2M_50</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.M_5_50"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">l2</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"new_baseline/{new_base}.{chrom}.l2.M"</span>,
        <span style="color: #FF9326;">l2M_50</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"new_baseline/{new_base}.{chrom}.l2.M_5_50"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">features</span>=<span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: all_annot.get(<span style="color: #B46DCC;">wildcards</span>.new_base),
        <span style="color: #FF9326;">anno</span>=<span style="color: #FFABAB;">"{new_base}"</span>
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/pull_ldscores_m50.R"</span>

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">get_annot_files</span>(<span style="color: #B46DCC;">wildcards</span>):
        <span style="color: #C8FF03;">return</span> {<span style="color: #FFABAB;">'anno_l2'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"{anno_name}.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23),anno_name=all_annot[<span style="color: #FFABAB;">'ptb_ldsc_model'</span>][<span style="color: #B46DCC;">wildcards</span>.anno_name]),
                <span style="color: #FFABAB;">'annotf'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"{anno_name}.{chrom}.annot.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23),anno_name=all_annot[<span style="color: #FFABAB;">'ptb_ldsc_model'</span>][<span style="color: #B46DCC;">wildcards</span>.anno_name]),
                <span style="color: #FFABAB;">'baseline_l2'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
                <span style="color: #FFABAB;">'gwasf'</span>:config_d[<span style="color: #FFABAB;">'GWAS'</span>] +f<span style="color: #FFABAB;">"ldsc_input/{wildcards.gwas}_gwas.sumstats.gz"</span>,
                <span style="color: #FFABAB;">'baselinef'</span>:  <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'WEIGHTS'</span>] +<span style="color: #FFABAB;">"weights.hm3_noMHC.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
                <span style="color: #FFABAB;">'freqf'</span>:  <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'FRQF'</span>] +<span style="color: #FFABAB;">"1000G.EUR.QC.{chrom}.frq"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
        }

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">get_annot_pairs</span>(<span style="color: #B46DCC;">wildcards</span>):
        <span style="color: #C8FF03;">return</span> {<span style="color: #FFABAB;">'anno_l2'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"{anno_name}.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23),anno_name=all_annot[<span style="color: #FFABAB;">'ptb_ldsc_model'</span>][<span style="color: #B46DCC;">wildcards</span>.anno_name]),
                <span style="color: #FFABAB;">'baseline_l2'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"baseline/baselineLD.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),

                <span style="color: #FFABAB;">'gwasfA'</span>:config_d[<span style="color: #FFABAB;">'GWAS'</span>] +f<span style="color: #FFABAB;">"ldsc_input/{wildcards.gwasA}_gwas.sumstats.gz"</span>,
                <span style="color: #FFABAB;">'gwasfB'</span>:config_d[<span style="color: #FFABAB;">'GWAS'</span>] +f<span style="color: #FFABAB;">"ldsc_input/{wildcards.gwasB}_gwas.sumstats.gz"</span>,
                <span style="color: #FFABAB;">'baselinef'</span>:  <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'WEIGHTS'</span>] +<span style="color: #FFABAB;">"weights.hm3_noMHC.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
                <span style="color: #FFABAB;">'freqf'</span>:  <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'FRQF'</span>] +<span style="color: #FFABAB;">"1000G.EUR.QC.{chrom}.frq"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
        }

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">run_ldsc</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #B46DCC;">unpack</span>(get_annot_files)
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">dataf</span>=<span style="color: #FFABAB;">"results/{gwas}/{anno_name}.results"</span>
    <span style="color: #99D6FF;">log</span>:
        <span style="color: #FF9326;">tempf</span>=<span style="color: #B46DCC;">temp</span>(<span style="color: #FFABAB;">"{gwas}_{anno_name}.log"</span>)
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">annot</span>=<span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: <span style="color: #FFABAB;">','</span>.join(<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"{anno_name}."</span>,anno_name=all_annot[<span style="color: #FFABAB;">'ptb_ldsc_model'</span>][<span style="color: #B46DCC;">wildcards</span>.anno_name])),
        <span style="color: #FF9326;">baseline</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"baseline/baselineLD."</span>,
        <span style="color: #FF9326;">weights</span>=config_d[<span style="color: #FFABAB;">'WEIGHTS'</span>]+<span style="color: #FFABAB;">"weights.hm3_noMHC."</span>,
        <span style="color: #FF9326;">frq</span>=config_d[<span style="color: #FFABAB;">'FRQF'</span>] +<span style="color: #FFABAB;">"1000G.EUR.QC."</span>,
        <span style="color: #FF9326;">odir</span>=<span style="color: #FFABAB;">"results/{gwas}/{anno_name}"</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'ldsc'</span>]
    <span style="color: #99D6FF;">shell</span>:
        config_d[<span style="color: #FFABAB;">'LDSC'</span>]+<span style="color: #FFABAB;">"ldsc.py --h2 {input.gwasf} --ref-ld-chr {params.annot},{params.baseline} --w-ld-chr {params.weights} --thin-annot --overlap-annot --frqfile-chr {params.frq} --out {params.odir} "</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">run_ldsc_cor</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #B46DCC;">unpack</span>(get_annot_pairs)
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">dataf</span>=<span style="color: #FFABAB;">"{gwasA},{gwasB}/{anno_name}.log"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">annot</span>=<span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: <span style="color: #FFABAB;">','</span>.join(<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"{anno_name}."</span>,anno_name=all_annot[<span style="color: #FFABAB;">'ptb_ldsc_model'</span>][<span style="color: #B46DCC;">wildcards</span>.anno_name])),
        <span style="color: #FF9326;">baseline</span>=config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"baseline/baselineLD."</span>,
        <span style="color: #FF9326;">weights</span>=config_d[<span style="color: #FFABAB;">'WEIGHTS'</span>]+<span style="color: #FFABAB;">"weights.hm3_noMHC."</span>,
        <span style="color: #FF9326;">frq</span>=config_d[<span style="color: #FFABAB;">'FRQF'</span>] +<span style="color: #FFABAB;">"1000G.EUR.QC."</span>,
        <span style="color: #FF9326;">odir</span>=<span style="color: #FFABAB;">"{gwasA},{gwasB}/{anno_name}"</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'ldsc'</span>]
    <span style="color: #99D6FF;">shell</span>:
        config_d[<span style="color: #FFABAB;">'LDSC'</span>]+<span style="color: #FFABAB;">"ldsc.py --rg {input.gwasfA},{input.gwasfB} --ref-ld-chr {params.annot},{params.baseline} --w-ld-chr {params.weights} --thin-annot --overlap-annot --frqfile-chr {params.frq} --out {params.odir} "</span>

<span style="color: #C8FF03;">def</span> <span style="color: #FFE203;">get_new_annot_files</span>(<span style="color: #B46DCC;">wildcards</span>):

        <span style="color: #C8FF03;">return</span> {<span style="color: #FFABAB;">'anno_l2'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"{anno_name}.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23),anno_name=all_annot[<span style="color: #FFABAB;">'ptb_ldsc_model'</span>][<span style="color: #B46DCC;">wildcards</span>.anno_name]),
                <span style="color: #FFABAB;">'baseline_l2'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"new_baseline/{new_base}.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23),new_base = <span style="color: #B46DCC;">wildcards</span>.new_base),
                <span style="color: #FFABAB;">'baseline_l2m'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"new_baseline/{new_base}.{chrom}.l2.M"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23),new_base = <span style="color: #B46DCC;">wildcards</span>.new_base),
                <span style="color: #FFABAB;">'baseline_l2m50'</span>:<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>] +<span style="color: #FFABAB;">"new_baseline/{new_base}.{chrom}.l2.M_5_50"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23),new_base = <span style="color: #B46DCC;">wildcards</span>.new_base),

                <span style="color: #FFABAB;">'baselinef'</span>:  <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'WEIGHTS'</span>] +<span style="color: #FFABAB;">"weights.hm3_noMHC.{chrom}.l2.ldscore.gz"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
                <span style="color: #FFABAB;">'freqf'</span>:  <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'FRQF'</span>] +<span style="color: #FFABAB;">"1000G.EUR.QC.{chrom}.frq"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23)),
        }

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">run_new_ldsc</span>:
      <span style="color: #99D6FF;">input</span>:
          <span style="color: #B46DCC;">unpack</span>(get_new_annot_files)
      <span style="color: #99D6FF;">output</span>:
            <span style="color: #FF9326;">dataf</span>=<span style="color: #FFABAB;">"results/{gwas}/{new_base}_{anno_name}.results"</span>
      <span style="color: #99D6FF;">log</span>:
          <span style="color: #FF9326;">tempf</span>=<span style="color: #B46DCC;">temp</span>(<span style="color: #FFABAB;">"{gwas}/{new_base}_{anno_name}.log"</span>)
      <span style="color: #99D6FF;">params</span>:
          <span style="color: #FF9326;">annot</span>=<span style="color: #C8FF03;">lambda</span> <span style="color: #B46DCC;">wildcards</span>: <span style="color: #FFABAB;">','</span>.join(<span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'L2'</span>]+<span style="color: #FFABAB;">"{anno_name}."</span>,anno_name=all_annot[<span style="color: #FFABAB;">'ptb_ldsc_model'</span>][<span style="color: #B46DCC;">wildcards</span>.anno_name])),
          <span style="color: #FF9326;">baseline</span>=config_d[<span style="color: #FFABAB;">"L2"</span>]+<span style="color: #FFABAB;">"new_baseline/{new_base}."</span>,
          <span style="color: #FF9326;">weights</span>=config_d[<span style="color: #FFABAB;">'WEIGHTS'</span>]+<span style="color: #FFABAB;">"weights.hm3_noMHC."</span>,
          <span style="color: #FF9326;">frq</span>=config_d[<span style="color: #FFABAB;">'FRQF'</span>] +<span style="color: #FFABAB;">"1000G.EUR.QC."</span>,
          <span style="color: #FF9326;">odir</span>=<span style="color: #FFABAB;">"results/{gwas}/{new_base}_{anno_name}"</span>
      <span style="color: #99D6FF;">conda</span>:
          config_e[<span style="color: #FFABAB;">'ldsc'</span>]
      <span style="color: #99D6FF;">shell</span>:
          config_d[<span style="color: #FFABAB;">'LDSC'</span>]+<span style="color: #FFABAB;">"ldsc.py --h2 {input.gwasf} --ref-ld-chr {params.annot},{params.baseline} --w-ld-chr {params.weights} --thin-annot --overlap-annot --frqfile-chr {params.frq} --out {params.odir}"</span>


</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nicholas Knoblauch</p>
<p class="date">Created: 2020-05-08 Fri 11:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
